tap "alecthomas/tap"
tap "argoproj/tap"
tap "boz/repo"
tap "chef/chef"
tap "derailed/k9s"
tap "go-task/tap"
tap "goreleaser/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "jzelinskie/faq"
tap "k14s/tap"
tap "robscott/tap"
tap "starkandwayne/kubernetes"
tap "layer5io/tap"

brew "ansible"
brew "antigen"
brew "asdf"
# Get stuff done with container-native workflows for Kubernetes
brew "argo"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Core application library for C
brew "glib"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Open source programming language to build simple/reliable/efficient software
brew "go"#, link: false
# Go dependency management tool
brew "dep"
brew "dive"
# Dancer's shell, or distributed shell
brew "dsh"
# Modern replacement for 'ls'
brew "exa"
# Command-line fuzzy finder written in Go
brew "fzf"
# Simplified Go project management, dependency management, and vendoring
brew "glide"
# GNU version of the tar archiving utility
brew "gnu-tar"
brew "localstack"
brew "mesheryctl"
# Generic library support script
brew "libtool"
# Manage compile and link flags for libraries
brew "pkg-config"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
brew "golang-migrate"
# Simple jira command-line client in Go
brew "go-jira"
# WSDL2Go code generation as well as its SOAP proxy
brew "gowsdl"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Make JSON greppable
brew "gron"
# Kubernetes package manager
brew "helm"
# Time series, events, and metrics database
brew "influxdb"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Istio configuration command-line utility
brew "istioctl"
# Json incremental digger
brew "jid"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Domain specific configuration language for defining JSON data
brew "jsonnet"
# Package manager for Jsonnet
brew "jsonnet-bundler"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli", link: false
# Production Grade K8s Installation, Upgrades, and Management
brew "kops"
# Package manager for kubectl plugins
brew "krew"
brew "kubebuilder"
# Kubernetes prompt info for bash and zsh
brew "kube-ps1"
# Manage complex enterprise Kubernetes environments as code
brew "kubecfg"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Kubernetes Native Serverless Framework
brew "kubeless"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Postgres C API library
brew "libpq"
# YAML Parser
brew "libyaml"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# Remote terminal application
brew "mosh"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Efficient rsh-like utility, for using hosts in parallel
brew "pdsh"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Tool for managing OCI containers and pods
brew "podman"
brew "postgresql"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Service monitoring system and time series database
brew "prometheus"
brew "protobuf"
# Password generator
brew "pwgen"
# Persistent key-value database, with built-in net interface
brew "redis"
# Function As A Service on top of Kubernetes, riff is for functions
brew "riff"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Standard unix software packaging tool
brew "rpm"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Work with remote images registries
brew "skopeo"
# Editor of encrypted files
brew "sops"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Tool to build, change, and version infrastructure
brew "terraform", link: false
# Improve Terraform's plan output
brew "terraform_landscape"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# Yet Another Dotfiles Manager
brew "yadm"
# Process YAML documents from the CLI
brew "yq"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
brew "zsh"
# Concurrently run Go lint tools and normalise their output.
brew "alecthomas/tap/gometalinter"
# kubernetes tail - pod log viewer
brew "boz/repo/kail"
# A viewer for git and diff output
brew "git-delta"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser/tap/goreleaser"
# Format Agnostic jQ
brew "jzelinskie/faq/faq"
# Kubernetes Workstation Tools
brew "k14s/tap/kwt"
# kube-capacity provides an overview of the resource requests, limits, and utilization in a Kubernetes cluster
brew "robscott/tap/kube-capacity"

tap "chrokh/tap"
brew "base16-manager"

brew "shellcheck"
#Temp tools
brew "cntlm"
tap "samuong/alpaca"
brew "samuong/alpaca/alpaca"


cask "authy"
cask "alfred"
cask "calibre"
cask "dash"
cask "docker"
cask "firefox"
cask "flux"
cask "google-cloud-sdk"
cask "inspec"
cask "intel-power-gadget"
cask "iterm2"
cask "logitech-options"
cask "lens"
cask "notion"
cask "obsidian"
cask "rectangle"
cask "spotify"
cask "tidal"
cask "the-unarchiver"
cask "vlc"
# Extract, view, and test RAR archives
cask "rar"
cask "raindropio"
cask "insomnia"
cask "zoom"
#$work related
cask "nosql-workbench"


mas "Spark – Email App by Readdle", id: 1176895641
mas "Slack", id: 803453959
mas "Kindle", id: 405399194
mas "1Password 7", id: 1333542190
mas "Paste - Clipboard Manager", id: 967805235
mas "Lightshot Screenshot", id: 526298438
mas "Toggl Track", id: 957734279
mas "Things", id: 904280696
mas "Reeder 5", id: 1529448980
mas "The Clock", id: 488764545
mas "Xcode", id: 497799835
mas "Instapaper", id: 1481302432

mas "Fantastical", id: 975937182
mas "Focus To-Do", id: 1258530160
mas "Living Earth Desktop", id: 539362919
mas "Memory Diag", id: 748212890
mas "MonthlyCal", id: 935250717
mas "PiPifier", id: 1160374471
