tap "alecthomas/tap"
tap "argoproj/tap"
tap "boz/repo"
tap "chef/chef"
tap "dandavison/delta", "https://github.com/dandavison/delta"
tap "derailed/k9s"
tap "go-task/tap"
tap "goreleaser/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "jzelinskie/faq"
tap "robscott/tap"
tap "starkandwayne/kubernetes"
tap "k14s/tap"


# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Official Amazon AWS command-line interface
brew "awscli"
brew "bat"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Open source programming language to build simple/reliable/efficient software
brew "go", link: false

brew "go-jira"
# Go dependency management tool
brew "dep"
# Dancer's shell, or distributed shell
brew "dsh"
# Modern replacement for 'ls'
brew "exa"
# Command-line fuzzy finder written in Go
brew "fzf"
# Simplified Go project management, dependency management, and vendoring
brew "glide"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Go programming environment (1.12)
brew "go@1.12"
# WSDL2Go code generation as well as its SOAP proxy
brew "gowsdl"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Make JSON greppable
brew "gron"
# The Kubernetes package manager
brew "helm"
# Time series, events, and metrics database
brew "influxdb"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Istio configuration command-line utility
brew "istioctl"
# Json incremental digger
brew "jid"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Domain specific configuration language for defining JSON data
brew "jsonnet"
brew "jsonnet-bundler"
brew "krew"
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Production Grade K8s Installation, Upgrades, and Management
brew "kops"
# Kubernetes prompt info for bash and zsh
brew "kube-ps1"
# Manage complex enterprise Kubernetes environments as code
brew "kubecfg"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Kubernetes Native Serverless Framework
brew "kubeless"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
brew "kwt"
# Postgres C API library
brew "libpq"
# Generic library support script
brew "libtool"
# YAML Parser
brew "libyaml"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# Remote terminal application
brew "mosh"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Efficient rsh-like utility, for using hosts in parallel
brew "pdsh"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Manage compile and link flags for libraries
brew "pkg-config"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Service monitoring system and time series database
brew "prometheus"
# Password generator
brew "pwgen"
#Podman
brew "podman"
# Persistent key-value database, with built-in net interface
brew "redis"
# Function As A Service on top of Kubernetes, riff is for functions
brew "riff"
# Standard unix software packaging tool
brew "rpm"
# Powerful, clean, object-oriented scripting language
brew "ruby"
brew "ripgrep"
# Work with remote images registries
brew "skopeo"
# Editor of encrypted files
brew "sops"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Tool to build, change, and version infrastructure
#brew "terraform", link: false
brew "tfenv"
# Improve Terraform's plan output
brew "terraform_landscape"
# Thin wrapper for Terraform e.g. for locking state
#brew "terragrunt"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extract, view, and test RAR archives
brew "unrar"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# Process YAML documents from the CLI
brew "yq"
brew "yadm"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Concurrently run Go lint tools and normalise their output.
brew "alecthomas/tap/gometalinter"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
# Get stuff done with container-native workflows for Kubernetes.
brew "argo"
# kubernetes tail - pod log viewer
brew "boz/repo/kail"
# A syntax-highlighting pager for git
brew "dandavison/delta/git-delta"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser/tap/goreleaser"
# Format Agnostic jQ
brew "jzelinskie/faq/faq"
# kube-capacity provides an overview of the resource requests, limits, and utilization in a Kubernetes cluster
brew "robscott/tap/kube-capacity"


cask "google-cloud-sdk"
#cask "google-chrome"
cask "inspec"
cask "vlc"
cask "chef/chef/inspec"
cask "the-unarchiver"
cask "iterm2"
cask "alfred"
cask "flux"
cask "rectangle"
cask "spotify"
cask "tidal"
cask "zoomus"
cask 'kindle'
cask 'dash'
cask 'witch'
cask "intel-power-gadget"
cask "notion"

mas "Living Earth Desktop", id: 539362919
mas "Memory Diag", id: 748212890
mas "MonthlyCal", id: 935250717
mas "PiPifier", id: 1160374471
mas "Reeder 5", id: 1529448980
mas "The Clock", id: 488764545
mas "Paste", id: 967805235
mas "Lightshot Screenshot", id: 526298438
mas "LastPass Password Manager", id: 926036361
mas "Focus To-Do: Pomodoro & Tasks", id: 1258530160
mas "Things 3", id: 904280696
mas "Xcode", id: 497799835
mas "Fantastical - Calendar & Tasks", id: 975937182
mas "Toggl Track - Hours & Time", id: 957734279
mas "1Password 7 - Password Manager", id: 1333542190
mas "Silicio 3 for Spotify + iTunes", id: 933627574
mas "Instapaper Save (1.1)", id: 1481302432

