tap "alecthomas/tap"
tap "ankitpokhrel/jira-cli"
tap "argoproj/tap"
tap "aws/tap"
tap "boz/repo"
tap "chef/chef"
tap "choria-io/tap"
tap "chrokh/tap"
tap "derailed/k9s"
tap "derailed/popeye"
tap "fairwindsops/tap"
tap "go-task/tap"
tap "goreleaser/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "jzelinskie/faq"
tap "kdash-rs/kdash"
tap "layer5io/tap"
tap "mike-engel/jwt-cli"
tap "robscott/tap"
tap "starkandwayne/kubernetes"
tap "vmware-tanzu/carvel"
tap "vmware-tanzu/tanzu"
tap "microsoft/git"

# CLI tool for working with Architecture Decision Records
brew "adr-tools"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Get stuff done with container-native workflows for Kubernetes
brew "argo"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# CLI to install, manage & troubleshoot Kubernetes clusters running Cilium
brew "cilium-cli"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Like cURL, but for gRPC
brew "grpcurl"
# Generic library support script
brew "libtool"
# YAML Parser
brew "libyaml"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library for command-line editing
brew "readline"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# GNU database manager
brew "gdbm"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Portable Foreign Function Interface library
brew "libffi"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Ruby environment tool
brew "chruby"
brew "choria-io/tap/appbuilder"
# Home for the Cluster Management API work, a subproject of sig-cluster-lifecycle
brew "clusterctl"
# Cross-platform make
brew "cmake"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go dependency management tool
brew "dep"
# Tool for exploring each layer in a docker image
brew "dive"
# Dancer's shell, or distributed shell
brew "dsh"
# Simple command-line tool for creating clusters on Amazon EKS
brew "eksctl"
# Modern replacement for 'ls'
brew "exa"
# Command-line fuzzy finder written in Go
brew "fzf"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Linting for your git commit messages
brew "gitlint"
# Simplified Go project management, dependency management, and vendoring
brew "glide"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Validating, recursive, caching DNS resolver
brew "unbound"
# "Github command-line tool"
brew "gh"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Simple jira command-line client in Go
brew "go-jira", link: false
# Database migrations CLI tool
brew "golang-migrate"
# WSDL2Go code generation as well as its SOAP proxy
brew "gowsdl"
# OpenType text shaping engine
brew "harfbuzz"
# Network, Service & Security Observability for Kubernetes using eBPF
brew "hubble"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Make JSON greppable
brew "gron"
# Kubernetes package manager
brew "helm"
# Deploy Kubernetes Helm Charts
brew "helmfile"
# Time series, events, and metrics database
brew "influxdb"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Istio configuration command-line utility
brew "istioctl"
# Json incremental digger
brew "jid"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Domain specific configuration language for defining JSON data
brew "jsonnet"
# Package manager for Jsonnet
brew "jsonnet-bundler"
# A super fast CLI tool to decode and encode JWTs built in Rust.
brew "mike-engel/jwt-cli/jwt-cli"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli", link: false
# Production Grade K8s Installation, Upgrades, and Management
brew "kops"
# Package manager for kubectl plugins
brew "krew"
# Kubernetes prompt info for bash and zsh
brew "kube-ps1"
# SDK for building Kubernetes APIs using CRDs
brew "kubebuilder"
# Manage complex enterprise Kubernetes environments as code
brew "kubecfg"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Kubernetes Native Serverless Framework
brew "kubeless"
# Kubernetes controller and tool for one-way encrypted Secrets
brew "kubeseal"
# Validate Kubernetes configuration files, supports multiple Kubernetes versions
brew "kubeval"
# Application Platform based on Kubernetes and Open Application Model
brew "kubevela"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Postgres C API library
brew "libpq"
# Emulator for x86 and PowerPC
brew "qemu"
# Linux virtual machines
brew "lima"  unless system "[[ $(uname -m) == x86_64 ]]"
# Fully functional local AWS cloud stack
brew "localstack"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Remote terminal application
brew "mosh"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
brew "nvm"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Efficient rsh-like utility, for using hosts in parallel
brew "pdsh"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Tool for managing OCI containers and pods
brew "podman"
# Object-relational database system
brew "postgresql@14"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Service monitoring system and time series database
brew "prometheus"
# Password generator
brew "pwgen"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Persistent key-value database, with built-in net interface
brew "redis"
# Function As A Service on top of Kubernetes, riff is for functions
# brew "riff"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Standard unix software packaging tool
brew "rpm"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Work with remote images registries
brew "skopeo"
# Editor of encrypted files
brew "sops"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Flexible, reusable and concise configuration for Kubernetes using Jsonnet
brew "tanka"
# Tool to build, change, and version infrastructure
brew "terraform", link: false
# Improve Terraform's plan output
brew "terraform_landscape"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# HTTP load testing tool and library
brew "vegeta"
# Modern watch command
brew "viddy"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# Yet Another Dotfiles Manager
brew "yadm"
# JavaScript package manager
brew "yarn"
# Process YAML documents from the CLI
brew "yq"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Concurrently run Go lint tools and normalise their output.
brew "alecthomas/tap/gometalinter"
# 🔥 Feature-rich interactive Jira command-line
brew "ankitpokhrel/jira-cli/jira-cli"
# Kubectl Argo Rollouts Plugin.
brew "argoproj/tap/kubectl-argo-rollouts"
# EC2 Instance Selector is a tool to filter EC2 instance types based on resource criteria
brew "aws/tap/ec2-instance-selector"
# kubernetes tail - pod log viewer
brew "boz/repo/kail"
# A command line tool to install base16 templates and set themes globally.
brew "chrokh/tap/base16-manager"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# A Kubernetes Cluster sanitizer and linter.
brew "derailed/popeye/popeye"
# Reverse Lookup for Kubernetes RBAC
brew "fairwindsops/tap/rbac-lookup"
brew "fairwindsops/tap/nova"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser/tap/goreleaser"
# Format Agnostic jQ
brew "jzelinskie/faq/faq"
# A fast and simple dashboard for Kubernetes written in Rust
brew "kdash-rs/kdash/kdash"
# The Cloud Native Management Plane.
brew "mesheryctl"
# Super fast CLI tool to decode and encode JWTs built in Rust
brew "mike-engel/jwt-cli/jwt-cli"
# kube-capacity provides an overview of the resource requests, limits, and utilization in a Kubernetes cluster
brew "robscott/tap/kube-capacity"
# Kapp
brew "vmware-tanzu/carvel/kapp"
# Tanzu Community Edition
brew "vmware-tanzu/tanzu/tanzu-community-edition"
brew "ykman"

# $work specific packages
# brew "samuong/alpaca/alpaca" unless system "[[ ! -f ~/.config/work ]]"

brew "saml2aws" unless system "[[ ! -f ~/.config/work ]]"
tap "afterpaytouch/platform", "git@github.com:afterpaytouch/homebrew-platform.git"
brew "kubectl-updateconfig" unless system "[[ ! -f ~/.config/work ]]"
brew "kubeup" unless system "[[ ! -f ~/.config/work ]]"
brew "apssh" unless system "[[ ! -f ~/.config/work ]]"
brew "kube-access-mysql" unless system "[[ ! -f ~/.config/work ]]"
brew "kube-access-pg" unless system "[[ ! -f ~/.config/work ]]"
brew "kube-access-redis" unless system "[[ ! -f ~/.config/work ]]"
brew "kube-access-port-fwd" unless system "[[ ! -f ~/.config/work ]]"


# Application launcher and productivity software
cask "alfred"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Two-factor authentication software
cask "authy"
# Utility to display the output from any script or program in the menu bar
cask "bitbar"
# E-books management software
cask "calibre" unless system "[[ -f ~/.config/work ]]"
# API documentation browser and code snippet manager
cask "dash"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox" unless system "[[ -f ~/.config/work ]]"
# Screen color temperature controller
cask "flux"
cask "git-credential-manager-core"
# Web browser
cask "google-chrome" unless system "[[ -f ~/.config/work ]]"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk" unless system "[[ -f ~/.config/work ]]"
cask "google-drive"
# Client for the Google Drive storage service
# HTTP and GraphQL Client
cask "insomnia"
cask "inspec"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Kubernetes IDE
# cask "lens"
# Open source build of Lens Kubernetes IDE
cask "openlens"
# Software for Logitech devices
cask "logi-options-plus"
# Support for Logitech G gear
cask "logitech-g-hub"
# Client-side GUI application for modern database development and operations
cask "nosql-workbench"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# All-in-one bookmark manager
cask "raindropio"
# Kubernetes and container management on the desktop
cask "rancher"
# Archive manager for data compression and backups
cask "rar"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Music streaming service
cask "spotify"
# Messaging app with a focus on speed and security
cask "telegram" unless system "[[ -f ~/.config/work ]]"
# Unpacks archive files
cask "the-unarchiver"
# Music streaming service with high fidelity sound and hi-def video quality
cask "tidal"
# Automatic time and productivity tracking app
cask "timing" unless system "[[ -f ~/.config/work ]]"
# To-do list
cask "todoist"
# Multimedia player
cask "vlc"
cask "yubico-yubikey-manager"
# Application for generating TOTP and HOTP codes
cask "yubico-authenticator"
# Video communication and virtual meeting platform
cask "zoom" unless system "[[ -f ~/.config/work ]]"

cask "intel-power-gadget" unless system "[[ $(uname -m) == arm64 ]]"

mas "1Password 7", id: 1333542190 unless system "[[ -f ~/.config/work ]]"
mas "Fantastical", id: 975937182 unless system "[[ -f ~/.config/work ]]"
mas "Focus To-Do", id: 1258530160
mas "Instapaper Save", id: 1481302432
mas "Kindle", id: 405399194
mas "Lightshot Screenshot", id: 526298438
mas "Living Earth Desktop", id: 539362919
mas "Memory Diag", id: 748212890
mas "MonthlyCal", id: 935250717
mas "Paste", id: 967805235
mas "PiPifier", id: 1160374471
mas "Reeder", id: 1529448980
mas "Slack", id: 803453959 unless system "[[ -f ~/.config/work ]]"
mas "Spark", id: 1176895641 unless system "[[ -f ~/.config/work ]]"
mas "Tailscale", id: 1475387142 unless system "[[ -f ~/.config/work ]]"
mas "The Clock", id: 488764545
mas "Things", id: 904280696
mas "Toggl Track", id: 957734279
mas "Timery for Toggl", id: 1425368544
# mas "Xcode", id: 497799835
